def MUL_Pxk_P(m, C, k):     		 # Умножение полинома на x^k:
    c_t = C.copy()                       # Создание копии массива, чтобы не затронуть исходные данные.
    for i in range(k):      		 # k раз добавляем 0 в самый маленький разряд,
        c_t.append([0, 1, [0], 1, [1]])  # сдвигая другие разряды в большую сторону.
    m += k                  		 # Не забываем увеличить степень.
    return [m, c_t]


arr = [[0, 1, [1], 1, [1]], [0, 1, [2], 1, [1]], [0, 1, [3], 1, [1]]]
m = 2                   # Пример: (x^2 + 2x^1 + 3) * x^2 = x^4 + 2x^3 + 3x^2
k = 2                   #         (Степень = 2)           (Степень = 4)
m, arr = MUL_Pxk_P(m, arr, k)
print(m, arr)
